[{
  "noteId": "1fff520d-e273-4a41-9c54-a203d808bb51",
  "title": "Moby Dick",
  "img_url": "note5.png",
  "content": "Call me Ishmael. Some years ago—never mind how long precisely—having little or no money in my purse, and nothing particular to interest me on shore, I thought I would sail about a little and see the watery part of the world. It is a way I have of driving off the spleen and regulating the circulation. Whenever I find myself growing grim about the mouth; whenever it is a damp, drizzly November in my soul; whenever I find myself involuntarily pausing before coffin warehouses, and bringing up the rear of every funeral I meet; and especially whenever my hypos get such an upper hand of me, that it requires a strong moral principle to prevent me from deliberately stepping into the street, and methodically knocking people’s hats off—then, I account it high time to get to sea as soon as I can. This is my substitute for pistol and ball. With a philosophical flourish Cato throws himself upon his sword; I quietly take to the ship. There is nothing surprising in this. If they but knew it, almost all men in their degree, some time or other, cherish very nearly the same feelings towards the ocean with me.",
  "userId": "42ab8ffd-2367-44fd-9568-87a19134053a",
  "createdAt": {
    "$date": "2023-05-14T19:48:44.571Z"
  },
  "updatedAt": {
    "$date": "2023-05-15T06:46:21.804Z"
  }
},{
  "noteId": "f0ecb913-10c3-4330-9b8e-a65399249a92",
  "title": "What is Angular?",
  "img_url": "note9.png",
  "content": "Angular is a development platform, built on TypeScript. As a platform, Angular includes:\nA component-based framework for building scalable web applications\nA collection of well-integrated libraries that cover a wide variety of features, including routing, forms management, client-server communication, and more\nA suite of developer tools to help you develop, build, test, and update your code\nWith Angular, you're taking advantage of a platform that can scale from single-developer projects to enterprise-level applications. Angular is designed to make updating as straightforward as possible, so take advantage of the latest developments with minimal effort. Best of all, the Angular ecosystem consists of a diverse group of over 1.7 million developers, library authors, and content creators.",
  "userId": "42ab8ffd-2367-44fd-9568-87a19134053a",
  "createdAt": {
    "$date": "2023-05-14T19:50:00.588Z"
  },
  "updatedAt": {
    "$date": "2023-05-15T06:48:44.444Z"
  }
},{
  "noteId": "3438bedf-29fa-49c8-aaeb-8cb7f555c4e4",
  "title": "What is Mongoose?",
  "img_url": "note2.png",
  "content": "Mongoose is an ODM (Object Data Modeling) library for MongoDB. While you don’t need to use an Object Data Modeling (ODM) or Object Relational Mapping (ORM) tool to have a great experience with MongoDB, some developers prefer them. Many Node.js developers choose to work with Mongoose to help with data modeling, schema enforcement, model validation, and general data manipulation. And Mongoose makes these tasks effortless.",
  "userId": "42ab8ffd-2367-44fd-9568-87a19134053a",
  "createdAt": {
    "$date": "2023-05-15T06:51:39.407Z"
  },
  "updatedAt": {
    "$date": "2023-05-15T06:51:39.407Z"
  }
},{
  "noteId": "07b47b9e-b554-4ccb-814b-14268f429bda",
  "title": "What is Express.js?",
  "img_url": "note11.png",
  "content": "Express.js, or simply Express, is a back end web application framework for building RESTful APIs with Node.js, released as free and open-source software under the MIT License. It is designed for building web applications and APIs. It has been called the de facto standard server framework for Node.js.",
  "userId": "42ab8ffd-2367-44fd-9568-87a19134053a",
  "createdAt": {
    "$date": "2023-05-15T06:52:56.868Z"
  },
  "updatedAt": {
    "$date": "2023-05-15T06:52:56.868Z"
  }
},{
  "noteId": "70634ed4-c8be-43d8-b379-7f8775fd48d4",
  "title": "What is Node.js?",
  "img_url": "note9.png",
  "content": "Node.js is a cross-platform, open-source server environment that can run on Windows, Linux, Unix, macOS, and more. Node.js is a back-end JavaScript runtime environment, runs on the V8 JavaScript Engine, and executes JavaScript code outside a web browser.",
  "userId": "42ab8ffd-2367-44fd-9568-87a19134053a",
  "createdAt": {
    "$date": "2023-05-15T06:55:33.099Z"
  },
  "updatedAt": {
    "$date": "2023-05-15T06:55:33.099Z"
  }
}]